#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AbelardLindsay/learning-devops-stuff/runs/run-HEBkWo4ToGkKhdKU

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/virtualNetworks/test-network]
azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/publicIPAddresses/test-pip]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/virtualNetworks/test-network/subnets/internal]
azurerm_network_interface.internal: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic2]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic1]
azurerm_network_security_group.casual-server: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkSecurityGroups/casual-server]
azurerm_network_interface_security_group_association.main: Refreshing state... [id=/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic2|/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkSecurityGroups/casual-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.main will be created
  + resource "azurerm_linux_virtual_machine" "main" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "test-vm"
      + network_interface_ids           = [
          + "/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic1",
          + "/subscriptions/440291d4-bce0-4614-a8fc-89f24d494835/resourceGroups/test-resources/providers/Microsoft.Network/networkInterfaces/test-nic2",
        ]
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "test-resources"
      + size                            = "Standard_F2"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20.04-LTS"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @AbelardLindsay, Action: `pull_request`*